name: "OnlineCellNet"
debug_info: false


# Train data layer
layer {
  name: "data"
  type: "MemoryData"
  top: "data"
  top: "labels"
  memory_data_param {
   batch_size: 4
   channels: 4
   height: 50
   width: 50
  }
}


# Convolution Layer - C1
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 20
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

# Pooling Layer - P1
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
  }
}

# Non-linear function
layer {
  name: "act1"
  bottom: "pool1"
  top: "act1"
  type: "TanH"
}

# Convolution Layer - C2
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "act1"
  top: "conv2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 50
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

# Pooling Layer - P2
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
  }
}

# Non-linear function
layer {
  name: "act2"
  bottom: "pool2"
  top: "act2"
  type: "TanH"
}

# Fully Connected Layer - FC1
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "act2"
  top: "ip1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

# Non-linear function
layer {
  name: "act3"
  bottom: "ip1"
  top: "act3"
  type: "TanH"
}

# Fully Connected Layer - FC2
layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "act3"
  top: "ip2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

# Loss
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip2"
  bottom: "labels"
  top: "loss"
}
